start_text = '''Бот работает с использованием официальных API-ключей, которые предоставляются после перевода вашего аккаунта на тип "КОМПАНИЯ". Важно отметить, что бот не будет функционировать с аккаунтом типа "ЧАСТНОЕ ЛИЦО". Бот поддерживает работу в любом выбранном вами тарифе.

Если у вас есть небольшое количество объявлений и ваш аккаунт на данный момент настроен как "ЧАСТНОЕ ЛИЦО", вам следует связаться с поддержкой Авито по номеру 8 800 600 00 01 и запросить изменение типа аккаунта на "КОМПАНИЯ". После этого вы сможете подключить любой тариф и получить доступ к API-ключам.

Важно помнить, что после перехода на тип "КОМПАНИЯ" вы будете обязаны подключить тариф с оплатой за просмотры, и обратное возвращение к бесплатным размещениям будет невозможным.

Желаем вам приятного использования бота. Если у вас возникнут вопросы, не стесняйтесь обращаться в нашу поддержку, доступную по ссылке @timaadev'''

instruct_first = '''ИНСТРУКЦИЯ №1 ❗️❗️❗️

В этом видео вы научитесь:

1.Создавать папку для того, чтобы было удобно работать и все чаты были у вас на виду

2.Создавать группу и добавлять бота (SK2) - не забудьте бота назначить АДМИНИСТАТОРОМ⚠️

Дальнейшую инструкцию Вы найдете при создании "Любой группы" после нажатия "/start"'''

before_reading = '''ПЕРЕД ИСПОЛЬЗОВАНИЕМ ОБЯЗАТЕЛЬНО ПРОЧТИТЕ❗️❗️❗️

Бот работает через официальные Api ключи, которые выдаются при переводе типа аккаунта на "КОМПАНИЮ" . Бот работает в любом тарифе❗️

ВАЖНО:  с типом "ЧАСТНОЕ ЛИЦО" БОТ работать НЕ  БУДЕТ❗️

Если у вас не много объявлений и подключен тип аккаунта "Частное лицо", то позвоните в поддержку Авито (8 800 600 00 01) и попросите перевести ваш аккаунт на тип "КОМПАНИЯ". После этого нужно будет подключить любой тариф. После подключения Вам будут доступны ключи. 

ВАЖНО❗️Если вы перейдете на тип "КОМПАНИЯ",нужно будет подключить тариф оплату за просмотры,обратно на бесплатные размещения перейти будет НЕ ВОЗМОЖНО❗️

Приятного пользования. С уважением команда SK_Avito_Bot. Будут вопросы, обязательно пишите😊 в нашу поддержку          👉 @Manager_SK2_Avito 👈

Так же попрошу Вас подписаться на мой канал @SK2_Avito_Kanal_Bot там будут выходить свежие новости,информация и различные обновления😊'''

instruct_second = '''ИНСТРУКЦИЯ №2 ❗️❗️❗️

Этапы, которые нужно сделать в этой инструкции:


1. Добавить созданную группу в созданную папку ( для удобства) 

2. Для того, чтобы бот работал - Нужно в строку ввести /start - После нажать на кнопку "Управление подпиской" - произвести оплату подписки и нажать на кнопку "Оплатил"✅

3. После оплаты можно вернуться в главное меню - нажать на кнопку "Проверить подписку💰" и убедиться, что подписка активна.

4. После успешной оплаты подписки можете переходить к пункту "Подключение аккаунта➕"'''

instruct_third = '''ИНСТРУКЦИЯ №3 ❗️❗️❗️

Этапы, которые нужно сделать в этой инструкции:


1. Переходим к пункту "Подключение аккаунта➕"

2. Вам нужно перейти к себе на авито в раздел "Для профессионалов" вкладка "Интеграции", снизу будет написано "Получить ключи" или они уже там будут

3. Копируйте слева "Номер профиля" он должен быть написан слитно БЕЗ ПРОБЕЛОВ❗️и вставляете в чат, который Вы создали

4. После копируйте ключи Client ID, Client secret. и вставляете это в чат который вы создали.

5. После того как вы скопировали ключи и номер профиля, нужно перейти в самого бота @SK2_Avito_bot ввести команду /start и нажать на кнопку "Список подключенных аккаунтов". Если вы увидите там свой аккаунт, значит вы сделали все ВЕРНО👍

PS. Инструкции по добавлению Автоответов пока что нет, но там никаких сложностей не должно возникнуть.

Больших продаж всем🚀 Будут вопросы обязательно пишите - Я всегда на связи🔥'''

shablon_text = '''✋ Здравствуйте!


Пришлите номер профиля Avito.ru!


Номер профиля можете найти в личном кабинете слева, либо в меню "Профиль" в моб. приложении!

Client_id можно найти в разделе "Интеграции" по ссылке - https://www.avito.ru/professionals/api

Client_secret можно найти в разделе "Интеграции" по ссылке - https://www.avito.ru/professionals/api

❗️Важно: интегрировать сообщения можно только владельцам максимального / расширенного тарифов!

Шаблон:
49702411
LgF3nrObD3ftikUcqPRO
lgyY2nOjvsN9rcskeqkcEV9L2oDxQWtmqa78Qgig'''

work_auto_ans = '''Как работать с автоответами
Автоответы созданы для автоматического общения с клиентами. Есть 3 вида автоответов:

Второй пункт хорошо подходит компаниям, которые работают строго по графику. В "определенный промежуток времени" можете настроить текст для рабочего и нерабочего времени.

1. На первое сообщение. На этом этапе Вы можете запланировать неограченное количество приветственных сообщений подряд. Для этого нужно нажать на кнопку "На первое сообщение", далее ввести текст первого сообщения и нажать на Enter. Если нужен второй текст, то пишем второй текст. Если больше не нужно других текстов нажимаем кнопку "Пропустить". Выйдет системное сообщение "Автоовтеты добавлены" 
 
2. В определенный промежуток времени. Для этого нужно ввести для первого текста начальное и конечное время, затем ввести текст для первого автоответа, если нужно запланировать еще и второй автоответ, то вводим начальное и конечное время второго автоответа, затем сам текст. Если не нужен второй текст, тогда нажимаем кнопку "Пропустить".
Например: у Вас какая-то компания, Вы хотите, чтобы бот отвечал на сообщения клиентов в нерабочее время. Чтобы запланировать такую функцию, нужно нажать на кнопку "В определенный промежуток времени" после этого ввести начальное время по (МСК) "18:00" и затем конечное время "10:00" , далее нужно запланировать текст. 

3. На триггер. Бот будет отвечать, если увидит в сообщении клиента триггер, который вы назначили. Их может быть несколько для одного автоответа. Например: айфон, iphone, яблоко фон. И нет разницы, большие или маленькие буквы. Если бот увидит это слово или словосочетание в сообщении клиента, он сразу ответит ему заготовленным текстом. Если триггеров будет несколько в одном сообщении, бот отправит несколько сообщений. Вы можете эту функцию использовать для удобства и быстрого ответа клиенту. Или вовсе выстроить с ним диалог, выдавая варианты сообщений, которые нужно написать для получения той или иной информации.

Добавить автоответ
Чтобы создать автоответ, нажмите в меню кнопку «🤖Автоответы», далее «➕Добавить автоответ» и далее пошагово ответьте на сообщения бота.

Удалить автоответ
Чтобы удалить шаблон, нажмите в меню кнопку «🤖Автоответы», далее «👀Показать автоответы» и далее нажмите «Удалить» под ненужным шаблоном.

Вкл/Выкл
Чтобы включить или выключить автоответ нажмите на кнопку "вкл" или "выкл"

Редактировать автоответ
Для редактирования автоответа вам нужно нажать на кнопку "изменить" ввести заного время и сам текст.'''

test_periiod_text = '''Тестовый период
    Тестовый период дается на ровно 24 часа, для того чтобы Вы успели за это время протестировать все возможные функции. 

    После тестового периода, нужно оплатить бессрочную подписку. После оплаты сможете продолжить Вашу работу

    Что бы воспользоваться данной функцией нужно:
    1. Нажать в главном меню на кнопку "Тестовый период" (рис.1)
    2. После нажатия вас система оповестит о выданном тестовом периоде. (рис.2)
    3. В главном меню Вы можете нажать на кнопку "Проверить подписку" и посмотреть дату окончания тестового периода  (рис.3)
    4. Для продолжения работы после тестового периода, нужно оплатить бессрочную подписку.'''