me = '@codenlx'
me_link = 'https://t.me/codenlx'
bot_link = '@tiqavito_bot'
start_text = f'''Бот работает с официальными API-ключами, предоставляемыми после перевода аккаунта на "КОМПАНИЯ". Обратите внимание, что бот не поддерживает аккаунты "ЧАСТНОЕ ЛИЦО" и может работать с любым тарифом, выбранным вами.

Если у вас немного объявлений и ваш аккаунт сейчас типа "ЧАСТНОЕ ЛИЦО", свяжитесь с поддержкой Авито по номеру  <code>8 800 600 00 01</code>, чтобы переключиться на "КОМПАНИЯ". После этого вы сможете подключить любой тариф и получить доступ к API-ключам.

Помните, что смена на "КОМПАНИЯ" обязывает вас использовать платный тариф с оплатой за просмотры, и вы не сможете вернуться к бесплатным размещениям.

Желаем вам успешного использования бота! Если возникнут вопросы, обращайтесь в нашу поддержку по ссылке {me}'''

instruct_first = '''<b>ИНСТРУКЦИЯ №1</b> ❗️

В этом видео вы научитесь:

1.Создавать папку для того, чтобы было удобно работать и все чаты были у вас на виду

2.Создавать группу и добавлять бота <a href = 'https://t.me/aviitoo_bot'>Avito bot</a> - не забудьте бота назначить <b>АДМИНИСТАТОРОМ</b>

Также инструкция в чате можете написав "/start"'''

before_reading = '''ПЕРЕД ИСПОЛЬЗОВАНИЕМ ОБЯЗАТЕЛЬНО ПРОЧТИТЕ❗️❗️❗️

Бот работает через официальные Api ключи, которые выдаются при переводе типа аккаунта на "КОМПАНИЮ" . Бот работает в любом тарифе❗️

ВАЖНО:  с типом "ЧАСТНОЕ ЛИЦО" БОТ работать НЕ  БУДЕТ❗️

Если у вас не много объявлений и подключен тип аккаунта "Частное лицо", то позвоните в поддержку Авито (8 800 600 00 01) и попросите перевести ваш аккаунт на тип "КОМПАНИЯ". После этого нужно будет подключить любой тариф. После подключения Вам будут доступны ключи. 

ВАЖНО❗️Если вы перейдете на тип "КОМПАНИЯ",нужно будет подключить тариф оплату за просмотры,обратно на бесплатные размещения перейти будет НЕ ВОЗМОЖНО❗️

Приятного пользования. С уважением команда SK_Avito_Bot. Будут вопросы, обязательно пишите😊 в нашу поддержку          👉 @Manager_SK2_Avito 👈

Так же попрошу Вас подписаться на мой канал @SK2_Avito_Kanal_Bot там будут выходить свежие новости,информация и различные обновления😊'''

instruct_second = f'''📋 ИНСТРУКЦИЯ №2 🚀🔑

Пройдите следующие шаги:

1. Добавьте созданную группу в специальную папку (для удобства).

2. Если вы новичок, попробуйте <b>ТЕСТОВЫЙ РЕЖИМ</b>:
   - Перейдите в личные сообщения к боту @Aviitoo_bot.
   - Напишите /start.
   - Выберите кнопку "Тестовый режим" 🧪.

3. Если нужно продлить подписку:
   - Введите команду /start.
   - Нажмите "Проверить статус подписки".
   - Если подписка не активна, нажмите "Продлить подписку" (на месяц).
   - Оплатите подписку и нажмите "Проверить платежи" ✅.

4. Вернитесь в главное меню и убедитесь, что подписка активна.
   
5. После активации подписки переходите к следующему этапу: "Подключить аккаунт ➕" 📦.

Будут вопросы? <a href = '{me_link}'>Пишите - мы готовы помочь. 🚀</a>


'''

instruct_third = '''📋 ИНСТРУКЦИЯ №3 🚀🔑


1. Перейдите к пункту "➕ Подключить аккаунт".

2. Зайдите в раздел "Для профессионалов" на Авито и выберите "Интеграции". Проверьте наличие "Получить ключи".

3. Скопируйте "Номер профиля" (без пробелов) и отправьте его в чат.

4. Скопируйте ключи Client ID и Client secret, и также отправьте их в чат.

5. После этого, выполните команду /start в чате с ботом @Aviitoo_bot и нажмите "Список подключенных аккаунтов". Если увидите свой аккаунт, значит, всё сделано верно.'''

shablon_text = '''✋ Здравствуйте!


Пришлите номер профиля Avito.ru!


Номер профиля можете найти в личном кабинете слева, либо в меню "Профиль" в моб. приложении!

Client_id можно найти в разделе "Интеграции" по ссылке - https://www.avito.ru/professionals/api

Client_secret можно найти в разделе "Интеграции" по ссылке - https://www.avito.ru/professionals/api

❗️Важно: интегрировать сообщения можно только владельцам максимального / расширенного тарифов!

Шаблон:
49702411
LgF3nrObD3ftikUcqPRO
lgyY2nOjvsN9rcskeqkcEV9L2oDxQWtmqa78Qgig'''

work_auto_ans = """
🤖<b>Работа с автоответами</b>🤖

📣 Добро пожаловать в раздел управления автоответами! Здесь вы можете настроить автоматические ответы для вашего бота. Это поможет в улучшении взаимодействия с вашими клиентами.

1️⃣ <b>На первое сообщение</b>: Настройте приветственное сообщение, которое будет отправляться при начале диалога с клиентом.

2️⃣ <b>В определенный промежуток времени</b>: Создайте автоответы для нерабочего времени. Например, настройте сообщения для ночного времени, чтобы информировать клиентов о рабочем графике.

3️⃣ <b>На триггер</b>: Назначьте ключевые слова или фразы, на которые бот будет автоматически отвечать. Это позволит быстро реагировать на запросы клиентов.

🔹 Чтобы настроить автоответы, выберите соответствующий раздел в меню и следуйте инструкциям бота.

🚫 Для отключения или удаления автоответов, также используйте раздел "Автоответы".

🔄 Помните, что хорошо продуманные автоответы могут значительно улучшить ваше взаимодействие с клиентами. Успешной настройки!
"""

test_periiod_text = '''
<b>🕐 Тестовый период</b>

Тестовый период дается <i>на ровно 24 часа</i>, чтобы вы успели <i>протестировать</i> все возможные функции.

После тестового периода, вам нужно будет <i>оплатить бессрочную подписку</i>, чтобы продолжить вашу работу.

Чтобы воспользоваться данной функцией, выполните следующие шаги:
1. Нажмите в главном меню на кнопку "Тестовый период" (см. рисунок 1).
2. После нажатия, система оповестит вас о выданном тестовом периоде (см. рисунок 2).
3. В меню чата вы можете нажать на кнопку "Проверить подписку" и узнать дату окончания тестового периода (см. рисунок 3).
4. Для продолжения работы после тестового периода, вам нужно будет оплатить бессрочную подписку.

Теперь вы готовы начать тестирование и определить, как наш бот может улучшить вашу работу! 🚀
'''

text_con = f'''
🔥 <b>Добро пожаловать в AvitoAuto</b> 🔥

📱 Мы представляем вам удобное и многофункциональное решение для общения с клиентами на Авито. Создайте чат-группу и добавьте нашего бота для управления вашими аккаунтами и автоответами.

🚀 <b>Как начать работу:</b>

1️⃣ Создайте чат-группу и пригласите бота в неё (см. Фото 1).
2️⃣ Нажмите на бота и выберите "Добавить в группу" (см. Фото 2).
3️⃣ Выберите вашу группу и добавьте бота (см. Фото 3).

💼 После добавления, назначьте бота администратором вашей группы (см. Фото 4). Теперь вы готовы управлять им в чате как обычным ботом.

✨ Для запуска бота, введите команду "/start" в чате. После этого появится клавиатура, где вы можете выбрать "Подключение аккаунта" и следовать инструкциям.

🔑 Вам потребуется указать:
1️⃣ <b>Номер профиля</b>
2️⃣ <b>Client_id</b>
3️⃣ <b>Client_secret</b>

⚠️ Пожалуйста, удостоверьтесь, что вы вводите эти данные правильно. Неправильно заполненные данные могут привести к невозможности интеграции с Avito.

👥 Удобно, когда у вас несколько аккаунтов разных проектов и отвечают разные менеджеры или вам нужно использовать разные автоответы. В чате может находиться несколько человек.

💡 В целом, удобнее всего объединять в один бот (чат с ботом) аккаунты Avito одной тематики, а для разных тематик создавать разные чаты с ботом. Каждому боту можно настроить свои автоответы.

🛠️ Бот будет постоянно усовершенствоваться. Если у вас есть пожелания по функционалу, пожалуйста, свяжитесь с нами <a href = "{me_link}">по ссылке</a>. Мы рассмотрим ваши пожелания!

🐞 Если вы обнаружите какой-то баг, ошибку или у вас есть вопросы, пожалуйста, напишите нам. Мы с радостью вам поможем <a href ="{me_link}">по ссылке</a>!

С уважением, команда AvitoAuto 
'''

text_answer = '''
📬 <b>Ответить на сообщение</b>

Для того, чтобы ответить на сообщение, нажмите кнопку "Ответить". У вас есть три различных способа для отправки ответа:

1️⃣ <b>Сейчас:</b> Отправьте ваше сообщение сразу.
2️⃣ <b>Запланированный ответ:</b> Запланируйте отправку сообщения на определенное время.
3️⃣ <b>Отправка в рабочее время:</b> Укажите время и сообщение отправить в ваше рабочее время.

Выберите подходящий способ и продолжайте эффективное общение с вашими клиентами!

🕒 <b>С уважением, команда AvitoAuto</b>

'''

text_show =  '''
✉️ <b>Посмотреть чат</b>

У вас есть возможность просматривать переписку в удобном формате. Под каждым сообщением вы найдете кнопку "Показать 10 сообщений". Нажмите на нее, чтобы открыть окно с последними 10 сообщениями.

Это поможет вам легко понять о чем была переписка и быстро находить нужные сведения.

<b>С уважением, команда AvitoAuto</b>
'''

data_text = '''
📈 <b>Просмотреть все чаты с пагинацией</b>

После отправки команды <code>/data</code>, вы сможете просматривать все ваши чаты с клиентами в удобном формате. Мы предоставляем пагинацию для более удобной навигации.

Используйте кнопки "Вперед" и "Назад" для просмотра разных чатов. Таким образом, вы сможете легко находить нужные беседы и общаться с клиентами.

🧩 <i>С уважением, команда AvitoAuto</i>

'''
